# Topic : R and W from DB
## 1. Reading_From_Table_UsingTableName
## 2 .Reading_From_Table_UsingSQLQuery
## 3. Writing_DF_To_DB
## 4. Reading_From_Table_UsingTableName(using read_sql function)

In [1]:
import pandas as pd
import sqlalchemy

# 1

In [2]:
# engine = sqlalchemy.create_engine("")
engine = sqlalchemy.create_engine('mysql+mysqldb://root:password@127.0.0.1:3306/cubdb').connect()

In [3]:
df=pd.read_sql_table('modeltrain_cptransposeaudit', engine)
df

,id,ProcessId,InputDF,OutputDF,OutputFile,InputUniqueValuesColumns,InputTransposeValues,InputTransposeColumns,LabelEncodingColumns,OutputTransposeIndex,OutputTransposeColumn,OutputTransposeValues,Template,Product,CallbackURL,Status,TransposeStatus,ErrorMessage
0,1,100,/home/pradeep.k@zucisystems.com/workspace_API/...,/home/pradeep.k@zucisystems.com/workspace_API/...,/home/pradeep.k@zucisystems.com/model_workspace/,"['CUSTOMERID', 'CONSTITUTION', 'RISK', 'GENDER...","['FORTNIGHT_END_DEPOSIT_BALANCE', 'FORTNIGHT_E...",['SEQUENC_VALUE'],"['SMASTATUS', 'NPASTATUS']",CUSTOMERID,FORTNIGHT,CUSTOMER_RATING,CP,Agri,http://localhost:2909/cub.jewel.transpose.call...,500,['Transpose Failed'],"[""[Errno 2] No such file or directory: '/home/..."

In [4]:
df = pd.read_sql_table('modeltrain_cptransposeaudit', engine,columns=["id","ProcessId","Product"])
df

   id ProcessId Product
0   1       100    Agri

# 2

In [5]:
query='''
SELECT 
cp.id,
cp.ProcessId 
from 
cubdb.modeltrain_cptransposeaudit cp 
'''
df = pd.read_sql_query(query,engine)
df

   id ProcessId
0   1       100

# 3

In [6]:
weather = pd.DataFrame({
    "city":["mumbai","delhi","banglore"],
    "Temp" : [32,45,30],
    "humidity":[80,60,70]
})
weather

       city  Temp  humidity
0    mumbai    32        80
1     delhi    45        60
2  banglore    30        70

In [7]:
weather.rename(columns={
    "city":"Place",
    "Temp" :"Temp",
    "humidity" : "Humidity"
},inplace=True)

In [8]:
weather

      Place  Temp  Humidity
0    mumbai    32        80
1     delhi    45        60
2  banglore    30        70

In [9]:
weather.to_sql(name="Weather",con=engine,index=False,if_exists='append')

# 4

In [10]:
pd.read_sql('Weather', engine)

       Place  Temp  Humidity
0     mumbai    32        80
1      delhi    45        60
2   banglore    30        70
3     mumbai    32        80
4      delhi    45        60
5   banglore    30        70
6     mumbai    32        80
7      delhi    45        60
8   banglore    30        70
9     mumbai    32        80
10     delhi    45        60
11  banglore    30        70

In [11]:
pd.read_sql('modeltrain_cptransposeaudit', engine)

,id,ProcessId,InputDF,OutputDF,OutputFile,InputUniqueValuesColumns,InputTransposeValues,InputTransposeColumns,LabelEncodingColumns,OutputTransposeIndex,OutputTransposeColumn,OutputTransposeValues,Template,Product,CallbackURL,Status,TransposeStatus,ErrorMessage
0,1,100,/home/pradeep.k@zucisystems.com/workspace_API/...,/home/pradeep.k@zucisystems.com/workspace_API/...,/home/pradeep.k@zucisystems.com/model_workspace/,"['CUSTOMERID', 'CONSTITUTION', 'RISK', 'GENDER...","['FORTNIGHT_END_DEPOSIT_BALANCE', 'FORTNIGHT_E...",['SEQUENC_VALUE'],"['SMASTATUS', 'NPASTATUS']",CUSTOMERID,FORTNIGHT,CUSTOMER_RATING,CP,Agri,http://localhost:2909/cub.jewel.transpose.call...,500,['Transpose Failed'],"[""[Errno 2] No such file or directory: '/home/..."